# Instacart — Part 2: Import combined orders & merge with products

**Goal:** Load `orders_products_combined.pkl`, verify shape, merge with prepared products on `product_id`, validate merge with flag, and export `ords_prods_merge`.

**Inputs**
- `02 Data/Prepared Data/orders_products_combined.pkl`
- `02 Data/Prepared Data/<your prepared products file>.csv`  *(cleaned + deduped)*

**Output**
- `02 Data/Prepared Data/ords_prods_merge.pkl` (recommended)

#Import and paths 

path = r'path = r"C:\Users\Neway\OneDrive\Desktop\instacart Basket Analysis'

In [19]:
#importing librarires
import pandas as pd
import numpy as np
import os

path = r"C:\Users\Neway\OneDrive\Desktop\instacart Basket Analysis"  

#importing_orders_products_combined dataframe fromt the pickle file
orders_products_combined = pd.read_pickle(os.path.join(path, '02 data' , 'prepared data' , 'orders_products_combined.pkl'))

In [22]:
4. #check to confirm the shape of the imported dataframe
orders_products_combined.shape

(32434489, 11)

The shape (rows and colums) are still the same.

In [23]:
#checking the column of the orders_product_combine 
orders_products_combined.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

5. Determine a suitable way to combine the orders_products_combined dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

In [24]:
#Import the prodcut dataframe from prepared data file
df_prods= pd.read_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'),index_col=0)

In [25]:
df_prods.head()

,product_name,aisle_id,department_id,prices
product_id,,,,
1,Chocolate Sandwich Cookies,61,19,5.8
2,All-Seasons Salt,104,13,9.3
3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
5,Green Chile Anytime Sauce,5,13,4.3

In [26]:
# checking the shape of the products dataframe
df_prods.shape

(49693, 4)

The suitable way to merge the df_ords_ords_prods_combined dataframe with the oroduct dataframe will be to use tge 'product _id' coulms.

In [30]:
#drop the merge column in the orders_products_combined DataFrame
orders_products_combined = orders_products_combined.drop(['_merge'], axis=1)

In [31]:
#check the output 
orders_products_combined.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,0,2539329,1,1,2,8,NaN,196,1,0
1,0,2539329,1,1,2,8,NaN,14084,2,0
2,0,2539329,1,1,2,8,NaN,12427,3,0
3,0,2539329,1,1,2,8,NaN,26088,4,0
4,0,2539329,1,1,2,8,NaN,26405,5,0

In [36]:
orders_products_combined.shape

(32434489, 10)

In [37]:
#merge updated DataFrame
df_ords_prods_merge = df_prods.merge(orders_products_combined, on = 'product_id', indicator = True)

In [38]:
df_ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,add_to_cart_order,reordered,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,3139998,138,28,6,11,3.0,5,0,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1977647,138,30,6,17,20.0,1,1,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,11433,389851,709,2,0,21,6.0,20,0,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,12198,652770,764,1,3,13,NaN,10,0,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,12200,1813452,764,3,4,17,9.0,11,1,both

In [39]:
#check the shape 
df_ords_prods_merge.shape

(32434212, 15)

6. Confirm the results of the merge using the merge flag

In [40]:
#checking the results of merge using merge flag 
df_ords_prods_merge['_merge'].value_counts()

_merge
both          32434212
left_only            0
right_only           0
Name: count, dtype: int64

7. Export the newly created dataframe as ords_prods_merge in a suitable format (taking into consideration the size).

# Export data to pkl
df_ords_prods_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merge.pkl'))